DataParallel(
  (module): MLPRegressor(
    (mlp): Sequential(
      (0): Linear(in_features=384, out_features=256, bias=True)
      (1): ReLU()
      (2): Linear(in_features=256, out_features=64, bias=True)
      (3): ReLU()
      (4): Linear(in_features=64, out_features=1, bias=True)
    )
  )
)